Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWallError Property
 Cannot create wall - it would intersect itself. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawSingularSlantedWallError { get; }
Public Shared ReadOnly Property CannotDrawSingularSlantedWallError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawSingularSlantedWallError {
	FailureDefinitionId^ get ();
}
static member CannotDrawSingularSlantedWallError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace